#Создаём строку из n массивов [0] - это столбцы
n = int(input())
s = [([0] * n) for i in range(n)]

#В каждом столбце добавляем числа - 
#значения в отдельных строках столбцов
for i in range(n):
    for j in range(n):
        s[i][j] = int(input())

#вводим кол-во бактерий...
m = int(input())
#Для каждой бактерии определяем позицию...
for i in range(m):
    b = int(input())
    a = int(input())
    #Вычитаем 8 или меньше бактерий из указанной клетки
    if s[a][b] >= 8:
        s[a][b] -= 8
    else:
        s[a][b] = 0
    #Вычитаем 4 или меньше из соседней слева
    if a > 0:
        if s[a - 1][b] >= 4:
            s[a - 1][b] -= 4
        else:
            s[a - 1][b] = 0
        #слева-сверху
        if b > 0:
            if s[a - 1][b - 1] >= 4:
                s[a - 1][b - 1] -= 4
            else:
                s[a - 1][b - 1] = 0
        #слева-снизу
        if b < (n - 1):
            if s[a - 1][b + 1] >= 4:
                s[a - 1][b + 1] -= 4
            else:
                s[a - 1][b + 1] = 0
    #справа
    if a < (n - 1):
        if s[a + 1][b] >= 4:
            s[a + 1][b] -= 4
        else:
            s[a + 1][b] = 0
        #справа-сверху
        if b > 0:
            if s[a + 1][b - 1] >= 4:
                s[a + 1][b - 1] -= 4
            else:
                s[a + 1][b - 1] = 0
        #справа-снизу
        if b < (n - 1):
            if s[a + 1][b + 1] >= 4:
                s[a + 1][b + 1] -= 4
            else:
                s[a + 1][b + 1] = 0
    #сверху
    if b > 0:
        if s[a][b - 1] >= 4:
            s[a][b - 1] -= 4
        else:
            s[a][b - 1] = 0
    #снизу
    if b < n - 1:
        if s[a][b + 1] >= 4:
            s[a][b + 1] -= 4
        else:
            s[a][b + 1] = 0
#выводим результат
for i in range(n):
    for j in range(n):
        print(s[i][j], end=' ')
    print()